In [1]:
import pandas as pd

In [2]:
my_series = pd.Series([1, 6, -5, 2, 7, -2])

In [3]:
my_series

0    1
1    6
2   -5
3    2
4    7
5   -2
dtype: int64

In [4]:
my_series[1]

6

In [6]:
my_series[1:2]

1    6
dtype: int64

In [7]:
my_series[my_series > 0]

0    1
1    6
3    2
4    7
dtype: int64

In [8]:
my_series * 2

0     2
1    12
2   -10
3     4
4    14
5    -4
dtype: int64

In [10]:
import numpy as np

In [11]:
np.exp(my_series)

0       2.718282
1     403.428793
2       0.006738
3       7.389056
4    1096.633158
5       0.135335
dtype: float64

In [12]:
np.sum(my_series)

9

In [13]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'], 
    'age': [25, 8, 48], 
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
})

In [14]:
df

     name  age          job  salary
0    Маша   25  Программист     100
1    Вася    8     Школьник      10
2  Эдуард   48     Big Boss     200

In [15]:
name = df['name']

In [16]:
name

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [17]:
df[df['age'] > 18]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big Boss     200

In [20]:
df['salary'] *= 10

In [21]:
df

     name  age          job  salary
0    Маша   25  Программист    2000
1    Вася    8     Школьник     200
2  Эдуард   48     Big Boss    4000

In [23]:
df['salary'] /= 2

In [24]:
df

     name  age          job  salary
0    Маша   25  Программист  1000.0
1    Вася    8     Школьник   100.0
2  Эдуард   48     Big Boss  2000.0

In [25]:
df.loc[1:2]

     name  age       job  salary
1    Вася    8  Школьник   100.0
2  Эдуард   48  Big Boss  2000.0

In [27]:
df.iloc[:1]

   name  age          job  salary
0  Маша   25  Программист  1000.0

In [28]:
df.T

                  0         1         2
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big Boss
salary         1000       100      2000